Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: See also posix_getgrgid() for information on how to convert this into a useable group name.
es: Vea también posix_getgrgid() para información sobre como convertir este número en un nombre de grupo manejable.

source: Return the numeric effective user ID of the current process.
es: Devuelve el valor numérico ID de usuario efectivo del proceso actual.

source: See also posix_getpwuid() for information on how to convert this into a useable username.
es: Vea también posix_getpwuid() para información sobre como convertir este número en un nombre de usuario manejable.

source: Return the numeric real group ID of the current process.
es: Devuelve el valor númerico ID de grupo real del proceso actual.

source: Returns an array of integers containing the numeric group ids of the group set of the current process.
es: Devuelve un vector de enteros que contiene los ids numéricos de grupo de el conjunto de grupos del proceso actual.

source: See also posix_getgrgid() for information on how to convert this into useable group names.
es: Vea también posix_getgrgid() para información sobre como convertir esto en nombres de grupo manejables.

source: Returns the login name of the user owning the current process.
es: Devuelve el nombre de usuario (login) que es dueño del proceso actual.

source: See posix_getpwnam() for information how to get more information about this user.
es: Vea posix_getpwnam() para información sobre como conseguir mas datos de este usuario.

source: Returns the process group identifier of the process pid.
es: Devuelve el identificador de grupo de procesos del proceso pid.

source: This is not a POSIX function, but is common on BSD and System V systems.
es: Esta no es una función POSIX, pero es normal en sistemas BSD y System V.

source: If your system does not support this function at system level, this PHP function will always return FALSE.
es: Si su sistema no soporta esta función a nivel de sistema, esta función PHP devolverá siempre FALSE.

source: Return the process group identifier of the current process.
es: Devuelve el identificador de grupo de proceso del proceso actual.

source: See POSIX.1 and the getpgrp( 2) manual page on your POSIX system for more information on process groups.
es: Vea POSIX.1 y la página de manual getpgrp( 2) de su sistema POSIX para más información de grupos de procesos.

source: Return the process identifier of the current process.
es: Devuelve el identificador de proceso del proceso actual.

source: Return the process identifier of the parent process of the current process.
es: Devuelve el identificador de proceso del proceso padre del proceso actual.

source: Returns an associative array containing information about a user referenced by an alphanumeric username, passed in the username parameter.
es: Devuelve un vector asociativo conteniendo información sobre un usuario referenciado por un nombre alfanumérico, pasado a la función en el parametro username.

source: The array elements returned are:
es: Los elementos del vector devuelto son:

source: The user information array
es: El vector de información de usuario

source: Element
es: Elemento

source: Description
es: Descripción

source: The name element contains the username of the user.
es: El elemento name contiene el nombre de usuario del usuario.

source: This is a short, usually less than 16 character "handle" of the user, not her real, full name.
es: Este es un nombre, normalmente menor de 16 caracteres, que no es su nombre completo, pero identifica al usario.

source: This should be the same as the username parameter used when calling the function, and hence redundant.
es: Este debe ser el mismo que el parámetro username usado en la llamada a la función y por lo tanto es redundante.

source: The passwd element contains the user 's password in an encrypted format.
es: El elemento passwd contiene la contraseña del usuario en un formato encriptado.

source: Often, for example on a system employing "shadow" passwords, an asterisk is returned instead.
es: Normalmente, por ejemplo en un sistema que este utilizando contraseñas "shadow", devolverá un asterisco.

source: User ID of the user in numeric form.
es: El ID de usuario del usuario en formato numérico.

source: The group ID of the user.
es: El ID de grupo del usuario.

source: Use the function posix_getgrgid() to resolve the group name and a list of its members.
es: Utiliza la función posix_getgrgid() para resolver el nombre del grupo y una lista de sus miembros.

source: GECOS is an obsolete term that refers to the finger information field on a Honeywell batch processing system.
es: GECOS es un término obsoleto que se refiere al campo apuntado de información en un sistema de procesamiento batch Honeywell.

source: The field contains a comma separated list containing the user 's full name, office phone, office number, and home phone number.
es: El campo y sus contenidos han sido formalizado por POSIX y contiene una lista separada por comas con el nombre completo del usuario, teléfono del trabajo, número de oficina y télefono de casa.

source: On most systems, only the user 's full name is available.
es: En muchos sistemas solo está disponible el nombre completo del usuario.

source: This element contains the absolute path to the home directory of the user.
es: Este elemento contiene la ruta absoluta al directorio del usuario (directorio home).

source: The shell element contains the absolute path to the executable of the user 's default shell.
es: El elemento shell contiene la ruta absoluta al ejecutable del shell por defecto del usuario.

source: Returns an associative array containing information about a user referenced by a numeric user ID, passed in the uid parameter.
es: Devuelve un vector asociativo que contiene información sobre un usuario referenciado con un ID de usuario, pasado por el parámetro uid.

source: User ID, should be the same as the uid parameter used when calling the function, and hence redundant.
es: ID del usuario, debe ser el mismo que el parametro uid usado en la llamada a la función, y por lo tanto redundante.

source: Return the sid of the process pid.
es: Devuelve el sid del proceso pid.

source: If pid is 0, the sid of the current process is returned.
es: Si pid es 0, se devolverá el sid del proceso actual.

source: This is not a POSIX function, but is common on System V systems.
es: Esta no es una función POSIX, pero es normal en sistemas System V.

source: Return the numeric real user ID of the current process.
es: Devuelve el valor numerico ID de usuario real del proceso actual.

source: Send the signal sig to the process with the process identifier pid.
es: Manda la señal sig al proceso con el identificador de proceso pid.

source: Returns FALSE, if unable to send the signal, TRUE otherwise.
es: Devuelve FALSE, si no puede enviar la señal.Si sí la envia devuelve TRUE.

source: See also the kill( 2) manual page of your POSIX system, which contains additional information about negative process identifiers, the special pid 0, the special pid -1, and the signal number 0.
es: Vea también la página de manual kill( 2) de su sistema POSIX, la cual contiene información adicional sobre los identificadores de proceso negativos, el pid especial 0, el pid especial -1, y la señal numero 0.

source: When safe mode is enabled, PHP checks whether the directory in which you are about to operate has the same UID (owner) as the script that is being executed.
es: Necesita ser escrito lo más pronto posible.

source: Set the real group ID of the current process.
es: Asigna el ID de grupo real del proceso actual.

source: This is a privileged function and you need appropriate privileges (usually root) on your system to be able to perform this function.
es: Esta es una función privilegiada y necesitas los privilegion apropiados (normalmente root) en tu sistema para realizar esta función.

source: The appropriate order of function calls is posix_setgid() first, posix_setuid() last.
es: El orden apropiado de llamada es posix_setgid() primero, posix_setuid() después.

source: Returns TRUE on success, FALSE otherwise.
es: Devuelve TRUE si tiene éxito, FALSE en caso contrario.

source: Let the process pid join the process group pgid.
es: Inserta el proceso pid en el grupo de procesos pgid.

source: See POSIX.1 and the setsid( 2) manual page on your POSIX system for more informations on process groups and job control.
es: Vea POSIX.1 y la página de manual setsid( 2) de su sistema POSIX para más información sobre grupos de procesos y control de trabajo.

source: Make the current process a session leader.
es: Convierte el proceso actual en lider de sesión.

source: Returns the session id.
es: Devuelve el id de sesión.

source: Set the real user ID of the current process.
es: Asigna el ID de usuario real al proceso actual.

source: See also posix_setgid().
es: Vea también posix_setgid().

source: Returns a hash of strings with information about the current process CPU usage.
es: Devuelve un hash de cadenas con información sobre el uso de CPU del proceso actual.

source: The indices of the hash are
es: Los índices del hash son

source: ticks - the number of clock ticks that have elapsed since reboot.
es: ticks - el numero de ticks de reloj que han pasado desde el reinicio.

source: utime - user time used by the current process.
es: utime - tiempo de usuario usado por el proceso actual.

source: stime - system time used by the current process.
es: stime - tiempo de sistema usado por el proceso actual.

source: cutime - user time used by current process and children.
es: cutime - tiempo de usuario usado por el proceso actual e hijos.

source: cstime - system time used by current process and children.
es: cstime - tiempo de sistema usado por el proceso actual e hijos.

source: Returns a hash of strings with information about the system.
es: Devuelve un hash de cadenas con información sobre el sistema.

source: sysname - operating system name (e.g.
es: sysname - nombre del sistema operativo (e.g.

source: nodename - system name (e.g. valiant)
es: nodename - nombre del sistema (e.g. valiant)

source: release - operating system release (e.g.
es: release - release del sistema operativo (e.g.

source: machine - system architecture (e.g. i586)
es: version - versión del sistema operativo (e.g. #4 Tue Jul 20 17:01:36 MEST 1999)

source: domainname - DNS domainname (e.g. php.net)
es: machine - arquitectura del sistema (e.g. i586)

source: Posix requires that you must not make any assumptions about the format of the values, e.g. you cannot rely on three digit version numbers or anything else returned by this function.
es: Posix requiere que usted no debe hacer ninguna suposición sobre el formato de los valores, por ejemplo usted no puede confiar en los tres dígitos de la version o cualquier cosa devuelta por esta función.

source: ?php var_dump( pow(2,8)); / / int(256) echo pow(-1,20); / / 1 echo pow(0, 0); / / 1 echo pow(-1, 5.5); / / error?
es: Devuelve base elevado a la potencia de exp.

source: See also exp() and sqrt().
es: Vea también exp().

source: preg_grep() returns the array consisting of the elements of the input array that match the given pattern.
es: preg_grep() devuelve un array conteniendo los elementos del array input que emparejen con el patrón (pattern) dado.

source: Since PHP 4.0.4, the results returned by preg_grep() are indexed using the keys from the input array.
es: Ejemplo 1.

source: If this behavior is undesirable, use array_values() on the array returned by preg_grep() to reindex the values.
es: Ejemplo de la función preg_grep()

source: Example 1. preg_grep() example
es: Nota:

source: / / return all array elements / / containing floating point numbers $fl_array = preg_grep ("/ ^(\d+)?\.\d+$ /", $array);
es: Inicio

source: Pattern Syntax
es: Subir

source: After the first match is found, the subsequent searches are continued on from end of the last match.
es: Busca en subject todos los emparejamientos de la expresión pattern y los pone en matches de la forma indicada por order.

source: Orders results so that $matches[ 0] is an array of full pattern matches, $matches[1] is an array of strings matched by the first parenthesized subpattern, and so on.
es: order puede tener los siguientes valores:

source: This example will produce:
es: Los resultados serán devueltos de manera que $matches[ 0] es un array con el patrón de búsqueda completo, $matches[1] es una array de las cadenas casadas por el primer subpatrón que esté entre paréntesis y así sucesivamente.

source: Orders results so that $matches[ 0] is an array of first set of matches, $matches[1] is an array of second set of matches, and so on.
es: preg_match_all( "_BAR_ [^] + (.*) / [^] + _BAR_U"," b example: / b div align=left this is a test / div ", $out, PREG_PATTERN_ORDER); print $out[0][0] .", ".$out[0][1] ."\n"; print $out[1][0] .", ".$out[1][1] ."\n"

source: If this flag is set, for every occuring match the appendant string offset will also be returned.
es: Los resultados son dados de manera que $matches[ 0] es una array del primer conjunto de emparejamientos, $matches[1] es un array de los segundos conjuntos de casamientos y así sucesivamente.

source: This flag is available since PHP 4.3.0.
es: preg_match_all( "_BAR_ [^] + (.*) / [^] + _BAR_U"," b example: / b div align=left this is a test / div ", $out, PREG_SET_ORDER); print $out[0][0] .", ".$out[0][1] ."\n"; print $out[1][0] .", ".$out[1][1] ."\n"

source: Getting all phone numbers out of some text.
es: Si order no es dado, se asume PREG_PATTERN_ORDER.

source: ?php / / The \\2 is an example of backreferencing.
es: Ejemplo 1.

source: The extra backslash is / / required because the string is in double quotes. $html = "b bold text / b a href=howdy.html click me / a"; preg_match_all (" / (([\w]+)[^ ]* )(.*) (\ / \\2) / ", $html, $matches); for ($i=0; $i count($matches[0]); $i++) {echo "matched: ".$matches[0][$i] ."\n"; echo "part 1: ".$matches[1][$i] ."\n"; echo "part 2: ".$matches[3][$i] ."\n"; echo "part 3: ".$matches[4][$i] ."\n\n";}?
es: Obtener los número de teléfonos de un texto.

source: matched: b bold text / b part 1: b part 2: bold text part 3: / b matched: a href=howdy.html click me / a part 1: a href=howdy.html part 2: click me part 3: / a
es: preg_match_all( "/ \(? (\d{3})?\)? (?(1) [\-\s]) \d{3}-\d{4} / x", "Call 555-1212 or 1-800-555-1212", $phones);

source: See also preg_match(), preg_replace(), and preg_split().
es: Examina también preg_match(), preg_replace() y preg_split().

source: Note that this changes the return value in an array where every element is an array consisting of the matched string at offset 0 and it 's string offset into subject at offset 1.
es: Busca en subject para un emparejamiento, dada la expresión pattern.

source: That will be either 0 times (no match) or 1 time because preg_match() will stop searching after the first match. preg_match_all() on the contrary will continue until it reaches the end of subject. preg_match() returns FALSE if an error occured.
es: Si matches es dado, entonces será definido con el resultado de la búsqueda. $matches[ 0] contendrá el texto que empareja con el patrón en su totalidad. $matches[1] tendrá la cadena que empareje con el primer subpatrón que esté entre paréntesis y así sucesivamente.

source: / / the "i" after the pattern delimiter indicates a case-insensitive search if (preg_match (" / php / i", "PHP is the web scripting language of choice .")) {print "A match was found .";} else {print "A match was not found .";}
es: Devuelve TRUE si se encontró en la cadena un emparejamiento dado el patrón pattern, FALSE si no se produjo o hubo un error.

source: / / the \b in the pattern indicates a word boundary, so only the distinct / / word "web" is matched, and not a word partial like "webbing "or "cobweb" if (preg_match (" / \bweb\b / i", "PHP is the web scripting language of choice .")) {print "A match was found .";} else {print "A match was not found .";} if (preg_match (" / \bweb\b / i", "PHP is the website scripting language of choice .")) {print "A match was found .";} else {print "A match was not found .";}
es: Ejemplo 1.

source: Getting the domain name out of a URL
es: Obtener el número de la siguiente página dada una cadena

source: If the optional delimiter is specified, it will also be escaped.
es: preg_quote() toma str y pone una barra invertida (\) delante de todo carácter que sea parte de la sintaxis de las expresiones.

source: The / is the most commonly used delimiter.
es: Es útil si tienes una cadena en tiempo de ejecución y puede contener caracteres especiales.

source: .\\ + *? [^] $() {} =! _BAR_:
es: Los caracteres especiales de las expresiones son:

source: / / In this example, preg_quote( $word) is used to keep the / / asterisks from having special meaning to the regular / / expression. $textbody = "This book is *very* difficult to find ."; $word = "*very*"; $textbody = preg_replace (" / ".preg_quote($word) ." / "," i ".$word. "/ i", $textbody);
es: Esta función fue añadida en PHP 3.0.9.

source: Searches subject for matches to pattern and replaces them with replacement.
es: Busca en subject los emparejamientos con pattern y los sustituye por replacement.

source: If limit is specified, then only limit matches will be replaced; if limit is omitted or is -1, then all matches are replaced.
es: replacement puede contener referencias de la forma\\ n.

source: Every such reference will be replaced by the text captured by the n 'th parenthesized pattern. n can be from 0 to 99, and \\0 or $0 refers to the text matched by the whole pattern.
es: Éstas serán sustituidas por el texto obtenido por el patrón del paréntesis n ésimo. n puede tener un valor de cero a noventa y nueve, y \\0 se refiere al texto casado por el patrón completo.

source: This creates an isolated $1 backreference, leaving the 1 as a literal.
es: Si el patrón no es encontrado en subject, entonces no se realizarán cambios.

source: Using backreferences followed by numeric literals.
es: Todos los parámetros de la función preg_replace() pueden ser un array.

source: ?php $str = "April 15, 2003"; $pattern =" / (\w+) (\d+), (\d+) / i"; $replacement = "\${1}1,\$3"; print preg_replace($pattern, $replacement, $string); / * Output ====== April1,2003 * /?
es: Si subject es un array, entonces la búsqueda y sustitución es realizada para todos los elementos de subject, y el valor devuelto es también un array.

source: Every parameter to preg_replace() (except limit) can be an array.
es: Si pattern y replacement son arrays, entonces preg_replace() toma un valor desde cada array y los usas para buscar y sustituir sobre subject.

source: When using arrays with pattern and replacement, the keys are processed in the order they appear in the array.
es: Si replacement tiene menos valores que pattern, entonces la cadena vacía es usada como valor para el resto de sustituciones.

source: If you use indexes to identify which pattern should be replaced by which replacement, you should perform a ksort() on each array prior to calling preg_replace().
es: Si pattern es una array y replacement es una cadena, entonces esta cadena de sustitución es usada para todos los valores de pattern.

source: Using indexed arrays with preg_replace()
es: Sin embargo, lo contrario no tiene sentido.

source: If pattern and replacement are arrays, then preg_replace() takes a value from each array and uses them to do search and replace on subject.
es: El modificador / e hace que la función preg_replace() trate el parámetro replacement como código PHP después de que la apropiada sustitución sea hecha.

source: If pattern is an array and replacement is a string, then this replacement string is used for every value of pattern.
es: Atención, asegúrate que replacement es un código PHP correcto, de otro modo PHP dará un error de parse en la línea que contenga preg_replace().

source: The converse would not make sense, though.
es: Nota:

source: /e modifier makes preg_replace() treat the replacement parameter as PHP code after the appropriate references substitution is done.
es: Este modificador fue añadido en PHP 4.0.

source: Tip: make sure that replacement constitutes a valid PHP code string, otherwise PHP will complain about a parse error at the line containing preg_replace().
es: Ejemplo 1.

source: Replacing several values
es: Sustituir varios valores

source: $startDate = 5 / 27 / 1999
es: $patterns = array( "/ (19_BAR_20\d{2}) -(\d{1,2}) -(\d{1,2}) /", "/ ^\s*{(\w+)}\s*= / "); $replace = array("\\3 / \\4 / \\1", "$\\1 ="); print preg_replace($patterns, $replace, "{startDate} = 1999-5-27");

source: preg_replace ("/ (\ / ?)(\w+)([^ ]*) / e", "'\\1'.strtoupper('\\2') .'\\3'", $html_body);
es: Ejemplo 2.

source: Example 5.
es: Usar el modificador / e

source: / / $document should contain an HTML document. / / This will remove HTML tags, javascript sections / / and white space.
es: preg_replace( "/ (\ / ?)(\w+)([^ ]*) / e", "'\\1'.strtoupper('\\2') .'\\3'", $html_body);

source: Parameter limit was added after PHP 4.0.1pl2.
es: Pondrá en mayúscula todos los tags HTML del texto de entrada.

source: See also preg_match(), preg_match_all(), and preg_split().
es: Examina también preg_match(), preg_match_all(), y preg_split().

source: flags can be any combination of the following flags (combined with bitwise _BAR_ operator):
es: Nota:

source: If this flag is set, parenthesized expression in the delimiter pattern will be captured and returned as well.
es: Devuelve un array conteniendo las subcadenas de subject divididas mediante los emparejamientos limitados por pattern.

source: / / split the phrase by any number of commas or space characters, / / which include "", \r, \t, \n and \f $keywords = preg_split (" / [\s ,]+ / ", "hypertext language, programming");
es: Si el flags es PREG_SPLIT_NO_EMPTY entonces las cadenas vacías no serán devueltas por preg_split().

source: $str = 'string'; $chars = preg_split(' / /', $str, -1, PREG_SPLIT_NO_EMPTY); print_r($chars);
es: Ejemplo 1.

source: $str = 'hypertext language programming'; $chars = preg_split(' / /', $str, -1, PREG_SPLIT_OFFSET_CAPTURE); print_r($chars);
es: Obtener las partes de una cadena de búsqueda

source: See also spliti(), split(), implode(), preg_match(), preg_match_all(), and preg_replace().
es: $keywords = preg_split( "/ [\s ,]+ /", "hypertext language, programming");

source: Returns the array element in the previous place that 's pointed by the internal array pointer, or FALSE if there are no more elements.
es: Devuelve el elemento de la matriz que está en la posición anterior a la que apuntaba previamente el puntero interno, o FALSE si no hay más elementos.

source: If the array contains empty elements then this function will return FALSE for these elements as well.
es: Si la matriz contiene elementos vacíos, esta función también devolverá FALSE para dichos elementos.

source: To properly traverse an array which may contain empty elements see the each() function.
es: Para recorrer adecuadamente una matriz que puede contener elementos vacíos, vea la función each().

source: prev() behaves just like next(), except it rewinds the internal array pointer one place instead of advancing it.
es: prev() se comporta igual que next(), excepto que rebobina el puntero interno una posición en lugar de avanzarlo.

source: See also current(), end(), next(), and reset().
es: Vea también: current(), end() next() y reset()

source: range
es: rango

source: Example 1. printer_abort() example
es: Ejemplo 1. printer_abort() example

source: Example 1. printer_close() example
es: Ejemplo 1. printer_close() example

source: Example 1. printer_create_dc() example
es: Ejemplo 1. printer_create_dc() example

source: Example 1. printer_draw_bmp() example
es: Ejemplo 1. printer_draw_bmp() example
